# -*- coding: utf-8 -*-

"""
==================================================================================================================================================
                                                     杭州HUB仿真项目

                                    项目启动日期：2017年7月6日
                                    项目经理：
                                    项目启动标识：IRPORT OF EZHOU'S PROJECT  -- HZ
                                    ===========================================
                                    代码创建日期：2017年7月6日
                                    代码创建工程师：
                                    代码版本：1.0
                                    版本更新日期：2017年7月6日
                                    版本更新工程师：

                                    代码整体功能描述：程序的启动文件，
                                                      1、所有机器参数、全局参数初始化；
                                                      2、所有机器类的实例化；
                                                   ......
                                                   ......
                                                   ......


==================================================================================================================================================
"""


import simpy


#  以#号开头的注释行#号后要有两个空格

#  Global/Class Constants 全局常量安照python规范书中的CAPS_WITH_UNDER格式命名
MAX_MAC = 100
MIN_MAC = 50
RANDOM_SEED = 42


#  模块测试单元统一命名为: 模块名_test
#  模块的测试代码统一封装在测试模块中
def main_test():
    # init
    # env = simpy.Environment()
    print('\n\n\n\n\n'
          '                                                          Hello AIRPORT OF EZHOUS PROJECT  -- HZ !'
          ''
          ''
          '\n\n\n\n\n\n\n\n\n\n')


if __name__ == '__main__':
    main_test()
